Every vector space in Sage has a basis --- you can obtain this with the vector space method \verb?.basis()?, and the result is a list of vectors.  Another method for a vector space is \verb?.basis_matrix()? which outputs a matrix whose rows are the vectors of a basis.  Sometimes one form is more convenient that the other, but notice that the description of a vector space chooses to print the basis matrix (since its display is just a bit easier to read).  A vector space typically has many bases (infinitely many), so which one does Sage use?  You will notice that the basis matrices displayed are in reduced row-echelon form --- this is the defining property of the basis chosen by Sage.\par
%
Here is \acronymref{example}{RSB} again as an example of how bases are provided in Sage.
%
\begin{sageexample}
sage: V = QQ^3
sage: v1 = vector(QQ, [ 2, -3,  1])
sage: v2 = vector(QQ, [ 1,  4,  1])
sage: v3 = vector(QQ, [ 7, -5,  4])
sage: v4 = vector(QQ, [-7, -6, -5])
sage: W = V.span([v1, v2, v3, v4])
sage: W
Vector space of degree 3 and dimension 2 over Rational Field
Basis matrix:
[   1    0 7/11]
[   0    1 1/11]
sage: W.basis()
[
(1, 0, 7/11),
(0, 1, 1/11)
]
sage: W.basis_matrix()
[   1    0 7/11]
[   0    1 1/11]
\end{sageexample}
%
%
\begin{sageverbatim}
\end{sageverbatim}
%
