Now we recognize that every basis has the same size, even if there are many different bases for a given vector space.  The dimension is an important piece of information about a vector space, so Sage routinely provides this as part of the description of a vector space.  But it can be returned by itself with the vector space method \verb?.dimension()?.  Here is an example of a subspace with dimension 2.
%
\begin{sageexample}
sage: V = QQ^4
sage: v1 = vector(QQ, [2, -1, 3,  1])
sage: v2 = vector(QQ, [3, -3, 4,  0])
sage: v3 = vector(QQ, [1, -2, 1, -1])
sage: v4 = vector(QQ, [4, -5, 5, -1])
sage: W = span([v1, v2, v3, v4])
sage: W
Vector space of degree 4 and dimension 2 over Rational Field
Basis matrix:
[  1   0 5/3   1]
[  0   1 1/3   1]
sage: W.dimension()
2
\end{sageexample}
%
\begin{sageverbatim}
\end{sageverbatim}
%
