Computing the determinant in Sage is straightforward.
%
\begin{sageexample}
sage: A = matrix(QQ,[[ 4,  3, -2, -9, -11, -14, -4,  11,  -4,   4],
...                  [ 0,  1,  0, -1,  -1,  -3, -2,   3,   6,  15],
...                  [ 0,  1,  1,  1,   3,   0, -3,  -5,  -9,  -3],
...                  [-3,  3,  3,  6,  12,   3, -9, -12,  -9,  15],
...                  [-2,  0,  2,  3,   5,   3, -3,  -5,  -3,   7],
...                  [ 3,  3, -1, -7,  -8, -12, -5,   8,  -4,   9],
...                  [ 0, -1,  1,  2,   2,   5,  3,  -6,  -8, -12],
...                  [-1, -2, -1,  1,  -2,   5,  6,   3,   6,  -8],
...                  [ 2,  1, -3, -6,  -8,  -7,  0,  12,  11,   8],
...                  [-3, -2,  2,  5,   5,   9,  2,  -7,  -4,  -3]])
sage: A.determinant()
3
\end{sageexample}
%
Random matrices, even with small entries, can have very large determinants.
%
\begin{sageexample}
sage: B = matrix(QQ,  15, [
...   [-5, -5, -5,  4,  1,  1, -3,  0,  4,  4, -2, -4,  2,  3, -1],
...   [ 1,  1, -4,  3,  3,  4,  1, -1, -5,  4, -3,  0, -1,  0,  0],
...   [ 3,  4, -2,  3, -1, -5, -1, -4, -5,  0, -1,  2, -4, -1, -1],
...   [ 2, -4,  4, -3, -3, -3, -1, -3, -3, -1,  2,  4, -1, -1, -3],
...   [ 1,  4, -3, -1, -2, -2,  1, -1,  3, -5, -4, -2, -2, -2, -5],
...   [-1, -2,  4,  0,  4,  1,  1,  4, -5,  3,  1, -1,  4,  2, -2],
...   [ 4,  3,  2,  4,  4, -5,  2, -5, -5,  2, -5, -4, -4,  0,  3],
...   [ 1, -2,  0, -2, -2,  0,  2,  3,  1,  2, -4,  0, -5, -2,  2],
...   [-4, -4,  2,  1, -1,  4, -2,  1, -2,  2, -1, -1,  3,  4, -1],
...   [-4,  0,  2,  3, -4, -5,  3, -5,  4, -4, -2,  3,  3, -3,  0],
...   [ 1,  2,  3, -4,  2,  0, -4, -1,  1, -3,  1,  4, -2,  4, -1],
...   [-3,  3,  0,  2,  1, -2, -4,  0, -1, -1, -1,  2,  3,  1, -4],
...   [ 4,  3, -3, -4,  3,  1, -3,  2,  1, -5, -5, -3,  2,  1,  4],
...   [-3, -5, -1, -5, -2,  0, -3,  1,  2, -1,  0, -4,  3, -2,  3],
...   [-1,  1, -3, -1,  3, -3,  2, -3, -5, -1, -1,  3, -1,  2,  3]
...                       ])
sage: B.determinant()
202905135564
\end{sageexample}
%
Sage is incredibly fast at computing determinants with rational entries.  Try the following two compute cells on whatever computer you might be using right now.  The one unfamilar command clears the value of the determinant that Sage caches, so we get accurate timing information across multiple evaluations.
%
\begin{sageexample}
sage: C = random_matrix(QQ, 100, 100)
sage: timeit("C.determinant(); C._cache={}")      # random
5 loops, best of 3: 152 ms per loop
sage: C.determinant()                             # random
-54987836999...175801344
\end{sageexample}
%
\begin{sageverbatim}
\end{sageverbatim}
%
