As another demonstration of using Sage to help us understand spans, linear combinations, linear independence and reduced row-echelon form, we will recreate parts of \acronymref{example}{RES}.  Most of this should be familiar, but see the commments following.
%
\begin{sageexample}
sage: V = QQ^4
sage: v1 = vector(QQ, [2,1,3,2])
sage: v2 = vector(QQ, [-1,1,0,1])
sage: v3 = vector(QQ, [-8,-1,-9,-4])
sage: v4 = vector(QQ, [3,1,-1,-2])
sage: v5 = vector(QQ, [-10,-1,-1,4])
sage: y = 6*v1 - 7*v2 + v3 +6*v4 + 2*v5
sage: y
(9, 2, 1, -3)
sage: R = [v1, v2, v3, v4, v5]
sage: X = V.span(R)
sage: y in X
True
sage: A = column_matrix(R)
sage: P = [A.column(p) for p in A.pivots()]
sage: W = V.span(P)
sage: W == X
True
sage: y in W
True
sage: coeff = column_matrix(P)
sage: coeff.solve_right(y)
(1, -1, 2)
sage: coeff.right_kernel()
Vector space of degree 3 and dimension 0 over Rational Field
Basis matrix:
[]
sage: V.linear_dependence(P) == []
True
\end{sageexample}
%
The final two results --- a trivial null space for \verb?coeff? and the linear independence of \verb?P? --- both individually imply that the solution to the system of equations (just prior) is unique.  Sage produces its own linearly independent spanning set for each span, as we see whenever we inquire about a span.
%
\begin{sageexample}
sage: X
Vector space of degree 4 and dimension 3 over Rational Field
Basis matrix:
[    1     0     0 -8/15]
[    0     1     0  7/15]
[    0     0     1 13/15]
\end{sageexample}
%
Can you extract the three vectors that Sage uses to span \verb?X? and solve the appropriate system of equations to see how to write \verb?y? as a linear combination of these three vectors?  Once you have done that, check your answer \emph{by hand} and think about how using Sage could have been overkill for this question.
%
\begin{sageverbatim}
\end{sageverbatim}
%

%