\acronymref{example}{RSC5} turned on a non-trivial relation of linear dependence (\acronymref{definition}{RLDCV}) on the set $\set{\vect{v}_1,\,\vect{v}_2,\,\vect{v}_3,\,\vect{v}_4}$.  Besides indicating linear independence, the Sage vector space method \verb?.linear_dependence()? produces relations of linear dependence for linearly dependent sets.  Here is how we would employ this method in \acronymref{example}{RSC5}.  The optional argument \verb?zeros='right'? will produce results consistent with our work here, you can also experiment with \verb?zeros='left'? (which is the default).
%
\begin{sageexample}
sage: V = QQ^5
sage: v1 = vector(QQ, [1,  2, -1,   3,  2])
sage: v2 = vector(QQ, [2,  1,  3,   1,  2])
sage: v3 = vector(QQ, [0, -7,  6, -11, -2])
sage: v4 = vector(QQ, [4,  1,  2,   1,  6])
sage: R = [v1, v2, v3, v4]
sage: L = V.linear_dependence(R, zeros='right')
sage: L[0]
(-4, 0, -1, 1)
sage: -4*v1 + 0*v2 +(-1)*v3 +1*v4
(0, 0, 0, 0, 0)
sage: V.span(R) == V.span([v1, v2, v4])
True
\end{sageexample}
%
You can check that the list \verb?L? has just one element (maybe with \verb?len(L)?), but realize that any multiple of the vector \verb?L[0]? is also a relation of linear dependence on \verb?R?, most of which are non-trivial.  Notice that we have verified the final conclusion of \acronymref{example}{RSC5} with a comparison of two spans.\par
%
We will give the \verb?.linear_dependence()? method a real workout in the nest Sage subsection (\acronymref{sage}{COV}) --- this is just a quick introduction.
%
\begin{sageverbatim}
\end{sageverbatim}
%
