Sage can easily perform the two basic operations with vectors, vector addition, \verb?+?,  and scalar vector multiplication, \verb?*?.  Notice that Sage is not confused by an ambiguity due to multiple meanings for the symbols \verb?+? and \verb?*? --- for example, Sage knows that \verb?3 + 12? is different than the vector additions below.
%
\begin{sageexample}
sage: x = vector(QQ, [1, 2, 3])
sage: y = vector(QQ, [10, 20, 30])
sage: 5*x
(5, 10, 15)
sage: x + y
(11, 22, 33)
sage: 3*x + 4*y
(43, 86, 129)
sage: -y
(-10, -20, -30)
sage: w = (-4/3)*x - (1/10)*y
sage: w
(-7/3, -14/3, -7)
\end{sageexample}
%
\begin{sageverbatim}
\end{sageverbatim}
%
