Vector representation is described in the text in a fairly abstract fashion.  Sage will support this view (which will be useful in the next section), as well as providing a more practical approach.  We will explain both approaches.  We begin with an arbitrarily chosen basis.  We then create an alternate version of \verb?QQ^4? with this basis as a``user basis'', namely \verb?V?.
%
\begin{sageexample}
sage: v0 = vector(QQ, [ 1, 1, 1, 0])
sage: v1 = vector(QQ, [ 1, 2, 3, 2])
sage: v2 = vector(QQ, [ 2, 2, 3, 2])
sage: v3 = vector(QQ, [-1, 3, 5, 5])
sage: B = [v0, v1, v2, v3]
sage: V = (QQ^4).subspace_with_basis(B)
sage: V
Vector space of degree 4 and dimension 4 over Rational Field
User basis matrix:
[ 1  1  1  0]
[ 1  2  3  2]
[ 2  2  3  2]
[-1  3  5  5]
sage: V.echelonized_basis_matrix()
[1 0 0 0]
[0 1 0 0]
[0 0 1 0]
[0 0 0 1]
\end{sageexample}
%
Now, the construction of a linear transformation will use the basis provided for \verb?V?.  In the proof of \acronymref{theorem}{VRLT} we defined a linear transformation $T$ that equaled $\vectrepname{B}$.  $T$ was defined by taking the basis vectors of $B$ to the basis composed of standard unit vectors (\acronymref{definition}{SUV}).  This is exactly what we will accomplish in the following construction.  Note how the basis associated with the domain is automatically paired with the elements of the basis for the codomain.
%
\begin{sageexample}
sage: rho = linear_transformation(V, QQ^4, (QQ^4).basis())
sage: rho
Vector space morphism represented by the matrix:
[1 0 0 0]
[0 1 0 0]
[0 0 1 0]
[0 0 0 1]
Domain: Vector space of degree 4 and dimension 4 over Rational Field
User basis matrix:
[ 1  1  1  0]
[ 1  2  3  2]
[ 2  2  3  2]
[-1  3  5  5]
Codomain: Vector space of dimension 4 over Rational Field
\end{sageexample}
%
First, we verify \acronymref{theorem}{VRILT}:
%
\begin{sageexample}
sage: rho.is_invertible()
True
\end{sageexample}
%
Notice that the matrix of the linear transformation is the identity matrix.  This might look odd now, but we will have a full explanation soon.  Let's see if this linear transformation behaves as it should.  We will ``coordinatize'' an arbitrary vector, \verb?w?.
%
\begin{sageexample}
sage: w = vector(QQ, [-13, 28, 45, 43])
sage: rho(w)
(3, 5, -6, 9)
sage: lincombo = 3*v0 + 5*v1 + (-6)*v2 + 9*v3
sage: lincombo
(-13, 28, 45, 43)
sage: lincombo == w
True
\end{sageexample}
%
Notice how the expression for \verb?lincombo? is exactly the messy expression displayed in \acronymref{definition}{VR}. More precisely, we could even write this as:
%
\begin{sageexample}
sage: w == sum([rho(w)[i]*B[i] for i in range(4)])
True
\end{sageexample}
%
Or we can test this equality repeatedly with random vectors.
%
\begin{sageexample}
sage: u = random_vector(QQ, 4)
sage: u == sum([rho(u)[i]*B[i] for i in range(4)])
True
\end{sageexample}
%
Finding a vector representation is such a fundamental operation that Sage has an easier command, bypassing the need to create a linear transformation.  It does still require constructing a vector space with the alternate basis.  Here goes, repeating the prior example.
%
\begin{sageexample}
sage: w = vector(QQ, [-13, 28, 45, 43])
sage: V.coordinate_vector(w)
(3, 5, -6, 9)
\end{sageexample}
%
Boom!
%
\begin{sageverbatim}
\end{sageverbatim}
%
