Our conception of a vector space has become much broader with the introduction of abstract vector spaces --- those whose elements (``vectors'') are not just column vectors, but polynomials, matrices, sequences, functions, etc.  Sage is able to perform computations using many different abstract and advanced ideas (such as derivatives of functions), but in the case of linear algebra, Sage will primarily stay with vector spaces of column vectors.  \acronymref{chapter}{R}, and specifically, \acronymref{section}{VR} and \acronymref{sage}{SUTH2} will show us that this is not as much of a limitation as it might first appear.\par
%
While limited to vector spaces of column vectors, Sage has an impressive range of capabilities for vector spaces, which we will detail throughout this chapter.  You may have already noticed that many questions about abstract vector spaces can be translated into questions about column vectors.  This theme will continue, and Sage commands we already know will often be helpful in answering thse questions.\par
%
\acronymref{theorem}{SSS}, \acronymref{theorem}{NSMS}, \acronymref{theorem}{CSMS}, \acronymref{theorem}{RSMS} and  \acronymref{theorem}{LNSMS} each tells us that a certain set is a subspace.  The first is the abstract version of creating a subspace via the span of a set of vectors, but still applies to column vectors as a special case.  The remaining four all begin with a matrix and create a subspace of column vectors.  We have created these spaces many times already, but notice now that the description Sage outputs explicitly says they are vector spaces, and that there are still some parts of the output that we need to explain.  Here are two reminders, first a span, and then a vector space created from a matrix.
%
\begin{sageexample}
sage: V = QQ^4
sage: v1 = vector(QQ, [ 1, -1, 2, 4])
sage: v2 = vector(QQ, [-3,  0, 2, 1])
sage: v3 = vector(QQ, [-1, -2, 6, 9])
sage: W = V.span([v1, v2, v3])
sage: W
Vector space of degree 4 and dimension 2 over Rational Field
Basis matrix:
[    1     0  -2/3  -1/3]
[    0     1  -8/3 -13/3]
\end{sageexample}
%
\begin{sageexample}
sage: A = matrix(QQ, [[1, 2, -4,  0, -4],
...                   [0, 1, -1, -1, -1],
...                   [3, 2, -8,  4, -8]])
sage: W = A.column_space()
sage: W
Vector space of degree 3 and dimension 2 over Rational Field
Basis matrix:
[ 1  0  3]
[ 0  1 -4]
\end{sageexample}
%
\begin{sageverbatim}
\end{sageverbatim}
%
